<!-- placeholder-1 -->
```fish
terraform plan -chdir=./ -var-file=./vars.tfvars
```
<!-- placeholder-2 -->

<details><summary>Diff of 1 change.</summary>

```diff
+ module.kube-hetzner.local_file.kustomization_backup[0] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @tonitert at 2025-11-07T17:14:22Z [(view log)](https://github.com/tonitert/ad-infra-k3s/actions/runs/19175756725/job/54820009211#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube-hetzner.local_file.kustomization_backup[0] will be created
  + resource "local_file" "kustomization_backup" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "k3s_kustomization_backup.yaml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-18-d4f15006c8c98d4f78a2c306b3d58885.tfplan -->
<!-- placeholder-6 -->